---
layout: post
title: Why Scala&#58; La stack (2/2)
tags: [play , scala]
---
{% include JB/setup %}
<br /> 
<div class="p1">
  Passons maintenant au morceau &eacute;pineux. Play est un framework web dont la particularit&eacute; est d'&ecirc;tre enti&egrave;rement stateless, il est mu par Netty, le serveur HTTP asynchrone de RedHat. Il offre des API pour Java comme pour Scala depuis la version 2. C'est &eacute;videmment cette derni&egrave;re facette qui retient mon attention. 
</div> 
<div class="p2"> 
 <br /> 
</div> 
<div class="p1">
  Play ne repose pas sur la sp&eacute;cification Servlet (Netty non plus d'ailleurs), le seul standard auquel il semble adh&eacute;rer est HTTP. Il se d&eacute;compose principalement en trois couches: 
</div> 
<div class="p1">
  Le routeur: il d&eacute;fini dans un fichier les URI pris en charge par l'application ainsi que le contr&ocirc;leur associ&eacute; et la fonction qui sera invoqu&eacute;e. 
 <br /> 
 <br /> 
</div> 
<pre class="brush: bash; gutter:false; ">GET     /                           controllers.Application.index</pre> 
<br />Au d&eacute;but, je me suis dit que c'&eacute;tait plut&ocirc;t nase par rapport aux contr&ocirc;leurs annot&eacute;s du monde Java mais en fait cela pr&eacute;sente un avantage non n&eacute;gligeable: tous les acc&egrave;s HTTP de l'application sont centralis&eacute;s dans une seule ressource au lieu d'&ecirc;tre diss&eacute;min&eacute;s dans le code. Ce point a attir&eacute; mon attention car j'ai &eacute;t&eacute; r&eacute;cemment sensibilis&eacute; sur la s&eacute;curit&eacute; applicative et la ma&icirc;trise des points d'entr&eacute;e de l'application est un point clef. 
<br /> 
<br /> 
<div class="p1">
  Les contr&ocirc;leurs: ils prennent la forme d'objects Scala et les fonctions sont charg&eacute;es d'int&eacute;grer le mod&egrave;le (&agrave; la charge du d&eacute;veloppeur) et doivent retourner des impl&eacute;mentations d'Action 
</div> 
<div class="p2"> 
 <br /> 
</div> 
<pre class="brush: scala;  ">def index = Action {    Ok(views.html.index(&quot;Your new application is ready.&quot;))  }</pre> 
<br />Les Action permettent de sp&eacute;cifier la nature du retour: d&eacute;l&eacute;gation &agrave; une vue, JSon, le code HTTP de la r&eacute;ponse, les cookies, etc. 
<br /> 
<div class="p2"> 
 <br /> 
</div> 
<div class="p1">
  La vue: il est &eacute;quip&eacute; d'un moteur de templating sp&eacute;cifique bas&eacute; sur Scala: il supporte notamment le Currying et permet de manipuler les collections&nbsp; 
</div> 
<div class="p2"> 
 <br /> 
</div> 
<div class="p1">
  Nous sommes dans la dimension fonctionnelle, donc le typage est primordial, les routes comme les vues sont donc typ&eacute;es, ce ne sont pas simplement des fichiers plats &eacute;valu&eacute;s au runtime mais &agrave; la compilation. 
</div> 
<div class="p2"> 
 <br /> 
</div> 
<div class="p1">
  Somme toute, &agrave; quelques diff&eacute;rences identitaires pr&egrave;s, c'est proche de ce dont nous avons l'habitude au niveau du paradigme. 
</div> 
<div class="p2"> 
 <br /> 
</div> 
<div class="p1">
  En plus d'application exemples plut&ocirc;t riches, Play propose de cr&eacute;er un squelette d'application utilisable instantan&eacute;ment: 
</div> 
<div class="p1"> 
 <br /> 
</div> 
<pre class="brush:bash; gutter:false;"><br />$ play new the-babel-tower<br />       _            _<br /> _ __ | | __ _ _  _| |<br />| '_ \| |/ _' | || |_|<br />|  __/|_|\____|\__ (_)my<br />|_|            |__/<br /><br />play! 2.1-RC1 (using Java 1.7.0_07 and Scala 2.10.0-RC1), http://www.playframework.org<br /><br />The new application will be created in /private/tmp/the-babel-tower<br /><br />What is the application name? <br />&gt; the-babel-tower<br /><br />Which template do you want to use for this new application? <br /><br />  1             - Create a simple Scala application<br />  2             - Create a simple Java application<br /><br />&gt; 1<br />OK, application the-babel-tower is created.<br /><br />Have fun!<br /><br />$ cd the-babel-tower/<br /><br />$ play run<br />[info] Loading project definition from /private/tmp/the-babel-tower/project<br />[info] Set current project to the-babel-tower (in build file:/private/tmp/the-babel-tower/)<br /><br />[info] Updating {file:/private/tmp/the-babel-tower/}the-babel-tower...<br />[info] Done updating.                                                             <br />--- (Running the application from SBT, auto-reloading is enabled) ---<br /><br />[info] play - Listening for HTTP on /0:0:0:0:0:0:0:0:9000<br /><br />(Server started, use Ctrl+D to stop and go back to the console...)<br /></pre> 
<br />La page de garde comprend une directive qui g&eacute;n&egrave;re une vue descriptive de l'application: 
<br /> 
<div class="p2"> 
 <br /> 
</div> 
<pre class="brush:scala;"><br />@(message: String)<br /><br />@main(&quot;Welcome to Play 2.0&quot;) {<br />    <br />    @play20.welcome(message)<br />    <br />} <br /><br /></pre> 
<br />Je ne sais pas pour vous, mais moi &ccedil;a m'a fait penser au fameux phpinfo(). Et bien tout &ccedil;a, &ccedil;a roxxe car dans le d&eacute;veloppement d'applications web en java, maven permet de faire appel &agrave; une myriade de templates d'applications, mais &agrave; chaque fois que j'en ai essay&eacute; un, j'ai trouv&eacute; des d&eacute;pendances et des configurations dont je n'avais pas n&eacute;cessairement besoin me contraignant &agrave; un peu de m&eacute;nage. Du coup, quand je d&eacute;marre un projet j'ai pris l'habitude d'un simple archetype:create que je compl&egrave;te manuellement. Play pose l'essentiel, c'est fonctionnel et n'attend que votre code. 
<br /> 
<div class="p1"> 
 <br /> 
</div> 
<div class="p1"></div> 
<div class="p1"> 
 <span style="font-size: large;"><b>Back to basics.&nbsp;</b></span>Play est tr&egrave;s proche des couches basses. Il est ais&eacute; de positionner des headers, des cookies ou le code de retour. Il affiche se destiner au d&eacute;veloppement d'applications massivement sollicit&eacute;es et hautement scalables, du coup la philosophie n'est pas d'empiler les couches d'abstractions au dessus de HTTP et de HTML &agrave; l'oppos&eacute; d'autres frameworks MVC, comme si pour tirer le meilleur parti d'une infrastructure le d&eacute;veloppeur devait ma&icirc;triser toutes les couches. En tant que geek, m&ecirc;me si c'est une v&eacute;rit&eacute; de La Palice, j'abonde en ce sens et j'aime avoir du contr&ocirc;le sur les couches basses. 
</div> 
<div class="p1">
  Le revers de la m&eacute;daille est qu'il ne faut pas s'attendre &agrave; une galaxie de composants &agrave; la PrimeFaces, offrant des fonctionnalit&eacute;s riches pour un minimum d'efforts, comme s'il y avait une relation invers&eacute;e entre rapidit&eacute; de d&eacute;veloppement et poids sur l'environnement d'ex&eacute;cution… Le salut passe donc par Twitter Bootstrap (ou autre pour les HTML Heroes). 
</div> 
<div class="p1">
  C'est d'ailleurs ce qui m'a encourag&eacute; &agrave; &eacute;vincer le moteur de templating de Play: j'ai mis&eacute; sur du HTML statique compl&eacute;t&eacute; par du MVC client (Angular) et ai pris le parti d'exploiter Play qu'au travers de requ&ecirc;tes REST. Comme d&eacute;j&agrave; argument&eacute; dans un autre billet, si l'architecture est sans &eacute;tat, autant d&eacute;l&eacute;guer la charge de g&eacute;n&eacute;ration des vue au client, sa CPU est gratuite pour l'application! 
</div> 
<div class="p2"> 
 <br /> 
</div> 
<div class="p1">
  C'est dit et redit, Play est stateless, ce qui implique qu'aucune donn&eacute;e li&eacute;e &agrave; la session applicative ne figure dans la m&eacute;moire du serveur, pas m&ecirc;me l'authentification. D'ailleurs pour faire simple il n'y a aucune API int&eacute;gr&eacute;e de contr&ocirc;le d'acc&egrave;s et de gestion des r&ocirc;les! Les donn&eacute;es de session sont stock&eacute;es dans un cookie de type session sign&eacute;: il n'est pas forgeable et permet &agrave; chacune des instances de l'application de valider le cookie pr&eacute;sent&eacute; gr&acirc;ce &agrave; une clef de cryptage partag&eacute;e. Cela implique que l'utilisation de la session applicative est totalement diff&eacute;rente d'une application web stateful, exit les objets vomis dans la session sous peine de voir le poids des transferts s'envoler et les temps de r&eacute;ponse s'effondrer. D&eacute;cid&eacute;ment, le profil du d&eacute;veloppeur &eacute;ligible se distingue de plus en plus de celui rencontr&eacute; commun&eacute;ment pour le d&eacute;veloppement des applications d'entreprise… 
</div> 
<div class="p2"> 
 <br /> 
</div> 
<div class="p1">
  Revenons sur un point: pas d'API de s&eacute;curit&eacute; int&eacute;gr&eacute;e, enfin j'exag&egrave;re il y a un object (play.api.mvc.Security) offrant deux fonctions. Security ne suffit pas et d'ailleurs le sample Zentasks guide tout de m&ecirc;me les newbies tels que moi en proposant une trait &agrave; ajouter aux contr&ocirc;leurs des ressources soumises &agrave; contr&ocirc;le d'acc&egrave;s: elle v&eacute;rifie l'authentification comme le p&eacute;rim&egrave;tre de l'utilisateur sur l'application. Dans ses moments l&agrave;, malgr&eacute; les efforts investis sur le langage, il devient clair que pouvoir lire ais&eacute;ment du code Scala &eacute;crit par autrui va prendre encore un peu de temps, m&ecirc;me si apr&egrave;s coup, les concepts s'av&egrave;rent faciles &agrave; int&eacute;grer. Je vous invite &agrave; consulter le code de Zentasks ( 
 <a href="https://github.com/playframework/Play20/blob/master/samples/scala/zentasks/app/controllers/Application.scala#L70">https://github.com/playframework/Play20/blob/master/samples/scala/zentasks/app/controllers/Application.scala#L70</a>). Le guide de r&eacute;f&eacute;rence de la version pr&eacute;c&eacute;dente de cite &eacute;galement un plugin tiers (Deadbolt), j'ai pr&eacute;f&eacute;r&eacute; ne pas miser sur cette extension, il m'a paru &eacute;vident qu'une mont&eacute;e de version du framework pourrait ne pas forc&eacute;ment &ecirc;tre suivie par ses extensions, d'autant que l'histoire a d&eacute;montr&eacute; que la compatibilit&eacute; ascendante n'&eacute;tait pas une priorit&eacute; de Play. Co&iuml;ncidence: la mention vers ce plugin n'existe plus dans la documentation 2.1, d'ailleurs le chapitre sur la s&eacute;curit&eacute; a disparu… JSR-250 and @RolesAllowed, I miss you! 
</div> 
<div class="p2"> 
 <br /> 
</div> 
<div class="p1">
  J'ai d&eacute;cid&eacute; de b&acirc;tir sur une conception REST, il va donc me falloir du JSON. En Java c'est cool: JAXB, Jackson et POJO annot&eacute;s, le sujet est trait&eacute;. Avec Play, ce n'est pas beaucoup plus compliqu&eacute; mais c'est moche: il int&egrave;gre &eacute;galement Jackson mais l'utilisation est programmatique (bas&eacute; sur des maps) au lieu d'&ecirc;tre d&eacute;clarative: 
</div> 
<div class="p1"> 
 <br /> 
</div> 
<pre class="brush:scala;"><br />Json.obj(<br />  &quot;users&quot; -&gt; Json.arr(<br />    Json.obj(<br />      &quot;name&quot; -&gt; &quot;bob&quot;,<br />      &quot;age&quot; -&gt; 31,<br />      &quot;email&quot; -&gt; &quot;bob@gmail.com&quot;     <br />    ),<br />    Json.obj(<br />      &quot;name&quot; -&gt; &quot;kiki&quot;,<br />      &quot;age&quot; -&gt; 25,<br />      &quot;email&quot; -&gt; JsNull     <br />    )<br />  )<br />)<br /><br /></pre> 
<br />L'avantage est que la transformation n'est pas soud&eacute;e &agrave; un mod&egrave;le. 
<br /> 
<div class="p2"> 
 <br /> 
</div> 
<div class="p1">
  J'ai parl&eacute; de Slick pr&eacute;c&eacute;demment et l'int&eacute;gration se fait sans surprise, manuellement! Avec le cake pattern. Il y a n&eacute;anmoins un projet d'int&eacute;gration que je n'ai pas test&eacute; ( 
 <a href="https://github.com/freekh/play-slick">https://github.com/freekh/play-slick</a>) 
</div> 
<div class="p2"> 
 <br /> 
</div> 
<div class="p1">
  C'est la tendance, pour rationaliser les threads, les requ&ecirc;tes http sont servies de fa&ccedil;on asynchrone. Toutefois Play brouille un peu les pistes car il permet que le contenu de l'action du contr&ocirc;leur soit lui m&ecirc;me asynchrone (li&eacute;e &agrave; des I/O, charge transf&eacute;r&eacute;e &agrave; un backend, ou d&eacute;l&eacute;gu&eacute; &agrave; un autre pool de threads): 
</div> 
<div class="p1"> 
 <br /> 
</div> 
<pre class="brush:scala;"><br />def index = Action {<br />  val futureInt = scala.concurrent.Future { intensiveComputation() }<br />  Async {<br />    futureInt.map(i =&gt; Ok(&quot;Got result: &quot; + i))<br />  }<br />}<br /><br /></pre> 
<br /> 
<br /> 
<div class="p1">
  Du coup de prime abord, on est en droit de se poser en toute bonne fois une question parfaitement fausse: pourquoi les actions ne sont elles pas asynchrones par d&eacute;faut comme peut le proposer Grizzly (embarqu&eacute; dans Glassfish)? Mais pas de doute, Play traite bel et bien les requ&ecirc;tes de fa&ccedil;on asynchrone par d&eacute;faut, vous en trouverez l'explication d&eacute;taill&eacute;e&nbsp; 
 <a href="https://groups.google.com/forum/#!topic/play-framework-dev/30MqnKDp0Fs/discussion">ici</a> . 
</div> 
<div class="p2"> 
 <br /> 
</div> 
<div class="p1">
  Play revendique &ecirc;tre destin&eacute; au d&eacute;veloppement des applications web modernes, &agrave; ce titre il documente les types de restitutions un peu particuliers comme les r&eacute;ponses par morceaux (chunked responses), les comets sockets et les web sockets. Tout &ccedil;a c'est tr&egrave;s geek et permet de pousser des donn&eacute;es du serveur vers le navigateur. C'est &eacute;videmment tr&egrave;s appr&eacute;ci&eacute;. Ce qu'il l'est moins c'est l'API associ&eacute;e: les Enumerator, Enumeratee and co. Toutefois, ce n'est pas parce que je trouve la conception indigeste qu'elle est mauvaise et je pars du postulat que les gens qui s'aventurent &agrave; &eacute;crire des frameworks sont forc&eacute;ment brillants, mais quand je suis tomb&eacute; sur un article titr&eacute; 
 <a href="http://mandubian.com/2012/08/27/understanding-play2-iteratees-for-normal-humans/">&quot;Understanding Play2 Iteratees for Normal Humans&quot;</a>, je me suis dit que je n'avais pas du &ecirc;tre le seul… J'ai un peu transpir&eacute; mais j'ai fini par r&eacute;ussir &agrave; utiliser cette API. 
</div> 
<div class="p2"> 
 <br /> 
</div> 
<div class="p1">
  Pour continuer sur l'aspect 'application moderne', Play 2 g&egrave;re les sources CoffeeScript et LESS CSS. C'est cool d'autant que si le code contient une erreur de 'transpilation', elle est identifi&eacute;e et mise en forme dans le navigateur (il fait mieux qu'IntelliJ sur ce point l&agrave;!).&nbsp; 
</div> 
<div class="p2"> 
 <br /> 
</div> 
<div class="p1">
  Les modifications du code prises en compte &agrave; chaud en mode d&eacute;veloppement est un autre point positif de Play. Cela change par rapport &agrave; Java, car sans JRebel, il faut s'en remettre aux limites du hot code replace du compilateur, ou encore param&eacute;trer le conteneur pour scanner les diff&eacute;rences et red&eacute;ployer l'application le cas &eacute;ch&eacute;ant. Le co&ucirc;t de la compilation des classes Scala est largement compens&eacute; par le fonctionnement automatique, de plus le serveur ne conservant pas l'&eacute;tat des clients, c'est transparent c&ocirc;t&eacute; navigateur. Un bon point. 
</div> 
<div class="p2"> 
 <br /> 
</div> 
<div class="p1">
  Alors finalement, apr&egrave;s ce floril&egrave;ge de points tant&ocirc;t &agrave; l'avantage de Play et tant&ocirc;t pas, que puis-je proposer comme conclusion? D'abord, a-t-il sa place dans la galaxie des frameworks web? Oui assur&eacute;ment, car j'ai d&eacute;cr&eacute;t&eacute; pr&eacute;c&eacute;demment que Scala avait la sienne dans l'&eacute;cosyst&egrave;me et il faut une technologie web qui repose sur ce langage. Mais du coup Play 2 Scala, c'est pour qui? M&ecirc;me r&eacute;ponse que pour Scala: pour des d&eacute;veloppeurs murs ou de jeunes stars. 
 <span style="font-size: large;"><b>Simple ou simpliste?</b></span> Il y a un dogme sur lequel j'aimerais m'attarder, Play est souvent qualifi&eacute; de 'stack l&eacute;g&egrave;re' et du coup on a l'impression que tout est facile et rapide. Alors on l'a d&eacute;montr&eacute;, c'est rapidement pr&ecirc;t &agrave; coder, c'est l&eacute;ger &agrave; h&eacute;berger mais la productivit&eacute; ne me semble pas au rendez-vous, en tous cas au niveau des IHM, le budget d&eacute;veloppement le plus important d'un projet web: pas ou peu de composants ou autre taglib, il faut taper du HTML et du Javascript, c'est &eacute;videmment tendance mais s&ucirc;rement pas productif. Donc l&eacute;g&egrave;re implique &eacute;galement l&eacute;g&egrave;re en fonctionnalit&eacute;s! Ces &eacute;l&eacute;ments nous apporte la r&eacute;ponse &agrave; la question 'dans quel contexte utiliser Play?': s'il faut des stars et que c'est long &agrave; d&eacute;velopper, eh bien pas pour le d&eacute;veloppement web d'entreprise d&eacute;j&agrave;! D'autant que j'ai vu des applications JSF 1.2 cod&eacute;es moyennement se comporter correctement jusqu'&agrave; 900 utilisateurs concurrents sur un noeud modeste avec une JVM 32bits, donc avant d'avoir un besoin des atouts de Play, il faut &ecirc;tre s&ucirc;r d'avoir une activit&eacute; soutenue, ou avoir un budget d'h&eacute;bergement faible et des capacit&eacute;s en d&eacute;veloppement (du temps et pas d'argent… PME ou artisanat, non?). Ce qui me pousse &agrave; penser qu'il est r&eacute;solument taill&eacute; pour le web, le vrai, pas l'intranet, et m&ecirc;me pour le Cloud (alerte #buzzword) vu son app&eacute;tit d'oiseau en ressources mat&eacute;rielles, d'ailleurs l'&eacute;diteur ne s'y trompe pas et propose de d&eacute;ployer chez diff&eacute;rents fournisseurs en quelques commandes l'application fra&icirc;chement g&eacute;n&eacute;r&eacute;e. &nbsp; 
</div> 
<div class="p2"> 
 <br /> 
</div> 
<div class="p2"> 
 <br /> 
</div> 
<div class="p2"> 
 <br /> 
</div> 
<div class="p1">
  Voil&agrave;, c'est la fin de mon p&eacute;riple en Fonctionnalie. J'&eacute;tais parti plein d'espoirs fond&eacute;s sur ces technologies alternatives, qu'en reste-t-il aujourd'hui? J'ai pris du plaisir &agrave; coder d'une autre mani&egrave;re, Scala m'a montr&eacute; de nouveaux horizons et oblig&eacute; &agrave; revoir des algorithmes de base et &ccedil;a rafra&icirc;chit lorsque le quotidien est meubl&eacute; par de la &quot;tuyauterie&quot;. La pile propos&eacute;e m'a demand&eacute; de me rapprocher des couches basses et j'ai kiff&eacute;. Ca c'est pour le c&ocirc;t&eacute; geek. Maintenant si on devait m'annoncer que mon karma &eacute;tait de ne jamais pouvoir programmer avec ces outils que me manquerait-il le plus? Les lambdas et la fluidit&eacute; de l'API des collections, les case classes, le pattern matching et l'Option. Voil&agrave; pour le langage, mais du c&ocirc;t&eacute; des frameworks, Slick est fun mais actuellement d&eacute;cevant et JPA est ma&icirc;tris&eacute; et complet (l'une des specs les plus importantes de JavaEE); Play est hype, agr&eacute;able mais ne r&eacute;volutionne pas et j'ai l'impression que le d&eacute;funt Struts 1 &eacute;tait plus riche! De plus Play est stateless, mais il n'est que stateless; or si les technos web du JCP s'appuient sur des conceptions stateful, il reste n&eacute;anmoins possible de d&eacute;velopper des applications sans &eacute;tat avec les frameworks habituels. &nbsp; 
</div> 
<div class="p1">
  En anticipant &agrave; peine, Java8, ses lambdas et son API Stream conjugu&eacute;s &agrave; Lombok (pour donner aux beans la concision des case classes mais pas toutes leurs fonctionnalit&eacute;s)&nbsp; et &agrave; L'Optional de Guava&nbsp; apparaissent &ecirc;tre des palliatifs acceptables... en tous cas en attendant de voir si la stack autour de Scala arrive &agrave; se d&eacute;mocratiser. 
</div>
