---
layout: post
title: Retour sur DevoxxFr 2013
tags: [java , bigdata , scala , devoxxfr13 , javascript]
---
{% include JB/setup %}
<br /> 
<div class="separator" style="clear: both; text-align: center;"> 
 <a href="http://www.devoxx.com/plugins/servlet/builder/resource/DEVOXX2012/devox-logo.png" imageanchor="1" style="margin-left: 1em; margin-right: 1em;"><img border="0" src="http://www.devoxx.com/plugins/servlet/builder/resource/DEVOXX2012/devox-logo.png" /></a> 
</div> 
<div class="p1"> 
 <br /> 
</div> 
<div class="p1"> 
 <br /> 
</div> 
<div class="p1">
  Les cast codeurs viennent de nous dire au revoir, c'est le signal de cl&ocirc;ture de cette &eacute;dition 2013 de Devoxx France… Je vais vous tenter de vous livrer mes impressions encore ti&egrave;des et vous propose de partager les faits qui m'ont marqu&eacute; au cours de ces trois jours intenses! 
</div> 
<div class="p2"> 
 <br /> 
</div> 
<div class="p1"> 
 <b><span style="font-size: large;">On n'attire pas les mouches avec du vinaigre.&nbsp;</span></b>Nous, les geeks de 2013, avons la chance d'&eacute;voluer &agrave; une &eacute;poque au cours de laquelle il semble que la demande soit inf&eacute;rieure aux offres d'emploi tandis que les autres corporations traversent la crise. Rappelons que cela n'a pas toujours &eacute;t&eacute; le cas, car il y a maintenant une douzaine d'ann&eacute;es, lorsque les caps du passage &agrave; l'euro et Y2K ont &eacute;t&eacute; pass&eacute;s, la bulle internet a &eacute;clat&eacute; et le march&eacute; est devenu assez terne durant quelques ann&eacute;es. S&eacute;quence &quot;nostalgie qui ne me rajeunit pas&quot; et &quot;j'appr&eacute;cie ce que j'ai&quot;. Donc un nombre important de stands &eacute;taient tenus par des entreprises qui exposaient autant pour proposer leurs services que pour faire leurs emplettes sur le march&eacute; des consultants. Et comment attirer l'attention des membres d'une population majoritairement masculine? Avec de charmantes managers, commerciales ou encore charg&eacute;e de recrutement. Oui Mr GONCALVES, chevalier blanc tout de 
 <span class="s1"> 
  <strike>
    rose 
  </strike></span> noir v&ecirc;tu, apr&egrave;s le 
 <a href="http://antoniogoncalves.org/2013/02/21/sony-your-business-is-going-down-is-it-a-reason-to-play-with-women/">proc&egrave;s d'intention dress&eacute; contre Sony</a> au sujet d'une affiche misogyne d'un gout douteux, j'attends un nouveau plaidoyer pour d&eacute;noncer l'instrumentalisation de la femme &agrave; Devoxx! 
</div> 
<div class="p1"> 
 <br /> 
</div> 
<div class="separator" style="clear: both; text-align: center;"> 
 <a href="https://pbs.twimg.com/media/BGmE4TECIAExMPC.jpg:small" imageanchor="1" style="margin-left: 1em; margin-right: 1em;"><img border="0" height="320" src="https://pbs.twimg.com/media/BGmE4TECIAExMPC.jpg:small" width="240" /></a> 
</div> 
<div class="p1"> 
 <br /> 
</div> 
<div class="p2"> 
 <br /> 
</div> 
<div class="p1"> 
 <b><span style="font-size: large;">Goodies. </span></b>Ne stigmatisons pas il n'y avait pas que &ccedil;a pour attirer le geek sur les stands. Et tradition oblige, pour r&eacute;colter des contacts les exposants nous ont distribu&eacute; des t-shirts, des mugs, des clefs USB, des autocollants, des lingettes, des bo&icirc;tes &agrave; meuh, de la bi&egrave;re &agrave; la pression, des friandises et des d&eacute;capsuleurs! D'ailleurs je d&eacute;cerne la palme du Goody &agrave; RedHat pour son d&eacute;capsuleur OpenShift qui est bien sup&eacute;rieur &agrave; celui d'Oracle puisque celui-ci a en plus une capacit&eacute; de 4Go. J'aurais pay&eacute; pour l'avoir et il ne m'a co&ucirc;t&eacute; que mon adresse mail. Bref une belle ambiance. 
</div> 
<div class="separator" style="clear: both; text-align: center;"> 
 <a href="http://4.bp.blogspot.com/-nYSG_oyuAPw/UVgX0VyTI2I/AAAAAAAAAls/IvL_yUvQQDc/s1600/Photo+du+30-03-13+a%CC%80+07.18.jpg" imageanchor="1" style="margin-left: 1em; margin-right: 1em;"><img border="0" height="280" src="{{ BASE_PATH }}/assets/img/Retour+sur+DevoxxFr+2013/Photo+du+30-03-13+a+07.18.jpg" width="320" /></a> 
</div> 
<div class="p1"> 
 <br /> 
</div> 
<div class="p2"> 
 <br /> 
</div> 
<div class="p1"> 
 <b><span style="font-size: large;">Un parfum d'USI? </span></b>La premi&egrave;re keynote de cette ann&eacute;e a &eacute;t&eacute; une surprise avec une r&eacute;trospective sur l'histoire des &eacute;critures. Clarisse Herrenschmidt a balay&eacute; devant nous 6000 ans d'&eacute;volutions des signes pour nous amener habilement &agrave; r&eacute;fl&eacute;chir sur la transition dont nous sommes les acteurs. Ca m'a fait penser &agrave; la&nbsp; conf&eacute;rence de Michel SERRES &agrave; l'USI. En tout cas une tr&egrave;s bonne id&eacute;e.&nbsp; 
</div> 
<div class="p1">
  Ensuite, Stephan JANSEN nous a pr&eacute;sent&eacute; la finalisation de la transition Flash vers HTML5 sur Parleys. Ca d&eacute;chire le pr&eacute;puce… S'il subsistaient dans la salle des HTML5 sceptiques, il y a fort &agrave; parier qu'il y en a un peu moins aujourd'hui. 
</div> 
<div class="p1">
  Devoxx a &eacute;galement accueilli Martin ODERSKY, invit&eacute; de marque puisqu'il n'est autre que le &quot;papa&quot; de Scala. L&agrave; les choses ont &eacute;t&eacute; diff&eacute;rentes… J'en ai d&eacute;j&agrave; parl&eacute;, Scala a tendance &agrave; diviser et ce talk ne me para&icirc;t pas avoir arrang&eacute; les choses. Rapidement des slides sont apparues mettant dos &agrave; dos du code Scala et Java pour mettre en valeur la concision du premier face &agrave; la verbosit&eacute; de second. Quand il finit par avancer que les adeptes de la programmation fonctionnelle et ceux de l'orient&eacute; objet pourraient &ecirc;tre r&eacute;unis s'ils d&eacute;veloppaient en Scala, je me suis lev&eacute; et je suis parti. Mr ODERSKY, j'aime le vent de fra&icirc;cheur qu'apporte votre langage dans le paysage mais j'ai d&eacute;test&eacute; votre keynote.&nbsp; 
</div> 
<div class="p2"> 
 <br /> 
</div> 
<div class="p1">
  Mon DevoxxFr 2013 s'est compos&eacute; essentiellement de conf&eacute;rences et elles furent pour la plupart riches et les th&egrave;mes pr&eacute;sent&eacute;s confirment les tendances hype: technos front avec HTML5 et JS (un zeste de Dart et TypeScript), DevOps, Cloud, programmation fonctionnelle, Big Data et &eacute;videmment tout ce qui touche au langage Java et &agrave; JavaEE puisqu'ils font &eacute;videmment partie des fondamentaux. A noter qu'un virus s'est r&eacute;pandu dans les diff&eacute;rents sujets, le Raspberry Pi: Java Fx sur Pi, WAS sur Pi, piloter un Pi avec un minitel et j'en passe… j'ai eu l'impression de voir le remix de la collection des &quot;Martine&quot; dans lequel l'h&eacute;ro&iuml;ne aurait c&eacute;d&eacute; sa place &agrave; l'ordinateur &agrave; 20$. &nbsp; 
</div> 
<div class="p1">
  &nbsp;Et au passage, j'aimerais t&eacute;moigner de la qualit&eacute; de la s&eacute;lection des talks &quot;ind&eacute;pendants&quot; car tous ces sujets ne m'ont pas forc&eacute;ment int&eacute;ress&eacute; mais ils pr&eacute;sentaient en moyenne une qualit&eacute; &eacute;lev&eacute;e et il y en avait pour tous les niveaux. Je pr&eacute;cise &quot;ind&eacute;pendants&quot; (ne veux pas dire men&eacute;s par des free-lances) car il y avait &eacute;galement les &quot;partner slots&quot;: des confs qui sont r&eacute;serv&eacute;s pour les entreprises qui sponsorisent l'&eacute;v&egrave;nement. Et l&agrave; il y a eu des #fails &agrave; mon go&ucirc;t. DevoxxFr est une conf de techos: ils veulent voir du code et m&ecirc;me du live coding, du protocole, de l'ex&eacute;cution, mais pas une plaquette produit export&eacute;e au format PowerPoint. Pire certains l'ont visiblement fait en connaissance de cause pariant sauver les meubles avec un titre racoleur genre &quot;les secrets d'optimisation de performance d'un superhero&quot;, et paf des features tout le long. Sanction: je me l&egrave;ve et je pars. Messieurs les sponsors, je ne milite &eacute;videmment pas pour une &eacute;viction des partner slots, vos solutions sont loin d'&ecirc;tre d&eacute;nu&eacute;es d'int&eacute;r&ecirc;t mais j'attends de la d&eacute;mo, du log ou de la capture de trame, bref je veux que vous me mettiez le nez sous le capot&nbsp; avant de montrer la valeur de votre produit. DevoxxFr est, pour nous les informaticiens, l'occasion de collecter du savoir, nous ne pouvons pas nous contenter d'un spot pub de 50 minutes. J'ai &eacute;chang&eacute; avec d'autres participants et mon n'avis n'est pas isol&eacute;, j'ai m&ecirc;me entendu &quot;quand je vois que c'est un partner slot, je n'y vais m&ecirc;me pas&quot;. Il para&icirc;t n&eacute;cessaire que la copie soit revue et que vous partagiez avec nous. Si un boycott se g&eacute;n&eacute;ralisait, tout le monde serait perdant. Notons que je n'ai pas particip&eacute; &agrave; tous les talks sponsoris&eacute;s et que j'en ai vu certains qui r&eacute;pondaient &agrave; mes exigences, tous ne s'inscrivent donc pas dans cette d&eacute;marche. 
</div> 
<div class="p2"> 
 <br /> 
</div> 
<div class="p1"> 
 <b><span style="font-size: large;">&quot;Compile once, run everywhere&quot;&nbsp;</span></b>Depuis 1995 on nous raconte une belle histoire en vantant les m&eacute;rites de cette technologie qui pose une couche d'abstraction entre le mat&eacute;riel et le code source. Aujourd'hui l'abstraction propos&eacute;e par la programmation fonctionnelle nous &eacute;loigne encore un peu plus du hardware. Parmi tous les speakers, j'ai trouv&eacute; un extra terrestre: Martin THOMPSON. Pourquoi un extra terrestre? Eh bien ses propos sont anachroniques mais remettent clairement en question ce d&eacute;tachement: comment &eacute;viter des invalidation de cache de CPU (avec du padding), les gains apport&eacute;s par un mod&egrave;le m&eacute;moire pr&eacute;voyant d'exploiter des segments contigus, les lenteurs identifi&eacute;es tardivement &agrave; cause de diff&eacute;rences entre la plateforme de d&eacute;veloppement et l'environnement d'exploitation et j'en passe. Tout est donc bouscul&eacute;. Si le tuning que nous devons apporter &agrave; notre code tient compte de ces consid&eacute;rations, il devient par l&agrave; m&ecirc;me sp&eacute;cifique &agrave; une architecture mat&eacute;rielle et me voil&agrave; dans une conf&eacute;rence en 2013 qui pr&eacute;sente des concepts qui sont orthogonaux avec la gen&egrave;se m&ecirc;me de Java. Qu'en penser? Tout d'abord les unit&eacute;s de temps manipul&eacute;es par THOMPSON sont le nombre de cycles d'horloge et les nano secondes, et il se r&eacute;f&egrave;re au nombre d'instructions assembleur ex&eacute;cut&eacute;es par cycle pour appr&eacute;cier la performance d'un programme. Je ne sais pas pour vous mais de mon c&ocirc;t&eacute;, on me demande de m'int&eacute;resser &agrave; des probl&egrave;mes de lenteur quand l'effet sur l'exp&eacute;rience utilisateur engendre des attentes de plusieurs secondes (voire minutes!). Du coup les invocations de m&eacute;thode que je chasse affichent une dur&eacute;e de l'ordre de la centaine de milli secondes. Ces &eacute;carts &eacute;normes dans nos pr&eacute;occupations respectives sont directement li&eacute;s &agrave; la diff&eacute;rence de nos univers: mon quotidien est l'informatique de gestion: un client l&eacute;ger, un serveur d'app, une base de donn&eacute;es, des services web et les caches qui m'int&eacute;ressent stockent des objets m&eacute;tiers et pas des octets (enfin pas directement). En gros des I/O, de la s&eacute;rialisation, du parsing, des algos assez pauvres, bref &eacute;norm&eacute;ment de tuyauterie pla&ccedil;ant mes pr&eacute;occupations dans des sph&egrave;res nettement moins exigeantes que les siennes. Mais merci &agrave; lui de nous rappeler cette r&eacute;alit&eacute; et de nous pr&eacute;senter des pistes d'optimisation &agrave; explorer quand toutes les &eacute;vidences de haut niveau habituelles seront &eacute;puis&eacute;es. 
</div> 
<div class="p1">
  Au passage il nous fait profiter de son exp&eacute;rience en production avec le G1GC qui ne semble pas aussi prometteur que nous pouvions l'escompter, le poussant &agrave; revenir sur le CMS. On en apprend &eacute;galement sur les effets de l'immutabilit&eacute; de la programmation fonctionnelle sur le GC et il n'h&eacute;site pas &agrave; nous balancer quelques Scuds en demandant pourquoi des fonctionnalit&eacute;s du langage telles que les lambdas repr&eacute;sentent tant dans nos attentes quand il reste tellement &agrave; optimiser dans l'existant… D&egrave;s qu'elles seront disponibles dans Parleys, pr&eacute;cipitez vous sur ses prestations. 
</div> 
<div class="p2"> 
 <br /> 
</div> 
<div class="p1">
  Je termine ce billet en remerciant l'&eacute;quipe organisatrice de la manifestation: l'ambiance est au rendez-vous, y en a pour tous et la soir&eacute;e &quot;meet and greet&quot; (en observant la t&ecirc;te de quelques uns vendredi matin, &ccedil;a aurait pu s'appeler &quot;meet and drink&quot; :o) ) est une super opportunit&eacute; de rencontres et d'&eacute;change en mangeant du fromage. Vivement DevoxxFr 2014! 
</div>
